Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F01A.tmx
Source language: en_us
Languages: zh_cn

source: If were a boy again
zh_cn: 如果再回到童年

source: If I were a boy again,I would practise perseverance more often,and never give up a thing because it was hard or inconvenient.
zh_cn: 假如我再回到童年,我会更多地培养自己的毅力,决不因为事情艰难或麻烦而放弃不干。

source: If we want light,we must conquer darkness.Perseverance can sometimes equal genius in its results."There are only two creatures,"says a proverb;"who can surmount the pyramids-the eagle and the snail."
zh_cn: 谚语说：“能登上金字塔的生物只有两种——雄鹰与蜗牛。”如果我们需要光明,我们就得征服黑暗.在产生的结果方面,毅力往往可以与天才相媲美。

source: If I were a boy again,I would school myself into a habit of attention .I would let nothing come between me and the subject in hand.I would remember that a good skater never tries to skate in two directions at once.
zh_cn: 假如我再回到童年，我会培养自己专心致志的习惯；一旦手头有事，决不让任何东西使我分心。我会牢记：一位优秀的溜冰手从不试图同时滑向两个不同的方向。

source: The habit of attention becomes part of our life,if we begin early enough.
zh_cn: 如果及早养成专心致志的习惯，它就会成为我们生命的一个部分。

source: I often hear grown-up people say,"I could not fix my attention on the lecture or book,although I wished to do so,"and the reason is,the habit was not formed in youth.
zh_cn: 我常常听到成年认说：“尽管我希望集中注意力听讲课或读书，但往往做不到。”其愿意就在于年轻时没有养成这种习惯。假如我能重新活过，我会更加注意培养自己的记忆力。

source: If I were to live my life over again,I would pay more attention to the cultivation of the memory.
zh_cn: 我要采取一切可能的办法，在一切可能的场合,增强记忆力。

source: I would strengthen that faculty by every possible means, and,on every possible occasion.It takes a little hard work at first to remember things accurately;but memory soon helps itself,and gives very little trouble.
zh_cn: 要精确地记住一切事物，起初的确要作出一番小小的努力；但用不了多久，记忆力本身就会起作用，使记忆成为轻而易举的事。

source: It only needs early cultivation to become a power.
zh_cn: 只需及早培养，记忆自会成为一种才能。

source: If I were a boy again, I would cultivate courage.
zh_cn: 假如我又回到了童年，我就要培养勇气。"

source: "Nothing is so mild and gentle as courage, nothing so cruel and pitiless as cowardice," says a wise author.
zh_cn: 世上没有东西比勇气更温文尔雅，也没有东西比懦怯更残酷无情。"一位明智的作家曾说过。

source: We too often borrow trouble, and anticipate that may never appear.
zh_cn: 我们常常过多地自寻烦恼，"杞人忧天。"

source: The fear of ill exceeds the ill we fear. Dangers will arise in any career, but presence of mind will often conquer the worst of them.
zh_cn: 怕祸害比祸害本身更可怕,凡事都有危险，但镇定沉着往往能克服最严重的危险。

source: Be prepared for any fate, and there is no harm to be feared.
zh_cn: 对一切祸福做好准备，那么就没有什么灾难可以害怕的了。

source: If I were a boy again,I would look on the cheerful side.
zh_cn: 假如我能再回到童年，我会凡事都看光明的一面。

source: Life is very much like a mirror:if you smile upon it,it smiles back upon you;but if you frown and look doubtful on it,you will get a similar look in return.Inner sunshine warms not only the heart of the owner,but of all that come in contact with it.
zh_cn: 生活就像一面镜子：你朝它微笑，它也会朝你微笑：但如果你朝它皱眉头，它也会朝你皱眉头；内心的阳光不仅温暖了自己的心，同时也温暖了所有跟他接触的人的心。

source: Who shuts love out,in turn shall be shut from love.
zh_cn: “谁将爱拒之门外，谁就会被爱拒之门外。”

source: If I were a boy again,I would school myself to say “No“oftener.
zh_cn: 假如我再回到童年，我就要养成经常说“不”的习惯。

source: I might write pages on the importance of learning very early in life to gain that point where a young boy can stand erect,and decline doing an unworthy act because it is unworthy.
zh_cn: 我可以写上好几页，谈谈早期培养这一点的重要性,一个少年要能挺得起腰杆,拒绝做不值得做得事——就因为它不值得做。

source: If I were a boy again,I would demand of myself more courtesy towards my companions and friends,and indeed towards strangers as well.
zh_cn: 假如我再回到童年，我会要求自己对待同伴和朋友更礼貌，而且对陌生人也同样如此。

source: The smallest courtesies along the rough roads of life are like the little birds that sing to us all winter long,and make that season of ice and snow more endurable.
zh_cn: 再坎坷得人生道路上，最细小的礼貌犹如在漫长的冬季为我们唱歌的小鸟，使得冰天雪地的严冬变得较易忍受。

source: Finally,instead of trying hard to be happy,as if that were the sole purpose of life,I would,if I were a boy again,try still harder to make others happy.
zh_cn: 最后，假如我再回到童年，我不会竭力为自己谋幸福——仿佛那是人生的唯一目标；与之相反，我会更加努力——让他人幸福。
